---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.#ctor
source: html/0288f32f-a22a-6c6a-27c8-c2c96abb7d71.htm
---
# Autodesk.Revit.DB.GroupSet.#ctor Method

Initializes a new instance of the GroupSet class

## Syntax (C#)
```csharp
public GroupSet()
```